IDEA Open Model
TypeLinePosition Enumeration
Compatible with IDEA StatiCa Beta 20.0
 type position line support
 Namespace: IdeaRS.OpenModel.Detail.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum TypeLinePosition
Public Enumeration TypeLinePosition
Members
Member name | Value | Description
Point | 0 |  on point (0, 0) or selected point
OnWallEdge | 1 |  on wall edge
Polyline | 2 |  polyline
See Also
Reference
IdeaRS.OpenModel.Detail.Loading Namespace